DROP DATABASE IF EXISTS Clinic;

CREATE DATABASE IF NOT EXISTS Clinic;
USE Clinic;

-- Таблиця лікарів
CREATE TABLE Doctors (
    DoctorID INT AUTO_INCREMENT PRIMARY KEY,
    LastName VARCHAR(50) NOT NULL,
    FirstName VARCHAR(50) NOT NULL,
    DateOfBirth DATE NOT NULL,
    Specialty ENUM('ЛОР', 'Геніколог', 'Хірург') NOT NULL
);

-- Таблиця пацієнтів
CREATE TABLE Patients (
    PatientID INT AUTO_INCREMENT PRIMARY KEY,
    LastName VARCHAR(50) NOT NULL,
    FirstName VARCHAR(50) NOT NULL,
    DateOfBirth DATE NOT NULL,
    Gender ENUM('Male', 'Female') NOT NULL,
    PhoneNumber VARCHAR(15)
);

-- Таблиця амбулаторних карток
CREATE TABLE AmbulatoryCards (
    AmbulatoryCardID INT AUTO_INCREMENT PRIMARY KEY,
    PatientID INT NOT NULL,
    EntryDate DATE NOT NULL,
    FOREIGN KEY (PatientID) REFERENCES Patients(PatientID)
);

-- Таблиця медичних карток
CREATE TABLE MedicalRecords (
    RecordID INT AUTO_INCREMENT PRIMARY KEY,
    AmbulatoryCardID INT NOT NULL,
    HealthStatus TEXT NOT NULL,
    Notes TEXT,
    FOREIGN KEY (AmbulatoryCardID) REFERENCES AmbulatoryCards(AmbulatoryCardID)
);

-- Таблиця прийомів
CREATE TABLE Appointments (
    AppointmentID INT AUTO_INCREMENT PRIMARY KEY,
    PatientID INT NOT NULL,
    DoctorID INT NOT NULL,
    AppointmentDate DATETIME NOT NULL,
    Notes TEXT,
    FOREIGN KEY (PatientID) REFERENCES Patients(PatientID),
    FOREIGN KEY (DoctorID) REFERENCES Doctors(DoctorID)
);



-- Додавання даних у таблицю Doctors
INSERT INTO Doctors (LastName, FirstName, DateOfBirth, Specialty) 
VALUES 
('Семенчук', 'Василь', '1982-07-15', 'Хірург'),
('Кравченко', 'Ірина', '1991-02-11', 'Геніколог'),
('Онищенко', 'Павло', '1980-11-20', 'ЛОР'),
('Ткачук', 'Марина', '1985-01-17', 'Геніколог'),
('Гнатюк', 'Володимир', '1972-03-30', 'Хірург'),
('Мазур', 'Юлія', '1990-09-12', 'ЛОР'),
('Сергієнко', 'Наталя', '1983-05-28', 'Геніколог'),
('Демиденко', 'Олег', '1978-10-03', 'Хірург'),
('Бойко', 'Олена', '1994-06-15', 'ЛОР'),
('Ющенко', 'Роман', '1987-12-05', 'Хірург');

-- Додавання даних у таблицю Patients
INSERT INTO Patients (LastName, FirstName, DateOfBirth, Gender, PhoneNumber) 
VALUES 
('Зеленська', 'Ольга', '1993-08-20', 'Female', '0502223344'),
('Климчук', 'Андрій', '1980-09-11', 'Male', '0673322110'),
('Білик', 'Наталя', '1997-04-21', 'Female', '0639871234'),
('Савчук', 'Олександр', '1985-01-30', 'Male', '0504567891'),
('Лисенко', 'Аліна', '1999-02-14', 'Female', '0987650987'),
('Даниленко', 'Віталій', '1982-05-10', 'Male', '0931233210'),
('Гуменюк', 'Софія', '1995-12-02', 'Female', '0671112234'),
('Романчук', 'Валентин', '1979-08-19', 'Male', '0509991230'),
('Черниш', 'Вікторія', '2001-07-01', 'Female', '0991234561'),
('Костенко', 'Михайло', '1976-11-22', 'Male', '0639876544'),
('Коваль', 'Олександр', '1981-09-12', 'Male', '0964919563'),
('Гаврилюк', 'Андрій', '1980-01-07', 'Female', '0543017431'),
('Сидоренко', 'Наталія', '1992-05-04', 'Male', '0762683026'),
('Кравченко', 'Марія', '1987-08-25', 'Female', '0815759013'),
('Сидоренко', 'Дмитро', '2000-10-05', 'Female', '0507667279'),
('Гаврилюк', 'Наталія', '1996-01-07', 'Male', '0907424894'),
('Гаврилюк', 'Максим', '1995-03-11', 'Male', '0652897058'),
('Гаврилюк', 'Ольга', '1982-10-25', 'Female', '0967797221'),
('Цимбалюк', 'Максим', '2005-09-02', 'Male', '0813484844'),
('Сидоренко', 'Ірина', '1986-01-17', 'Male', '0813515520');


--  Додавання даних у таблицю Appointments
INSERT INTO AmbulatoryCards (PatientID, EntryDate)
VALUES
(1, '2024-12-01'),
(2, '2024-12-02'),
(3, '2024-12-03'),
(4, '2024-12-04'),
(5, '2024-12-05'),
(6, '2024-12-06'),
(7, '2024-12-07'),
(8, '2024-12-08'),
(9, '2024-12-09'),
(10, '2024-12-10'),
(11, CURDATE()),
(12, CURDATE()),
(13, CURDATE()),
(14, CURDATE()),
(15, CURDATE()),
(16, CURDATE()),
(17, CURDATE()),
(18, CURDATE()),
(19, CURDATE()),
(20, CURDATE());




-- Додавання даних у таблицю Appointments
INSERT INTO Appointments (PatientID, DoctorID, AppointmentDate, Notes)
VALUES
(11, 3, '2024-12-18 11:00:00', 'Діагностика стану.'),
(8, 3, '2024-12-18 10:00:00', 'Проведення консультації.'),
(7, 3, '2024-12-18 12:00:00', 'Призначення лікування.'),
(2, 3, '2024-12-18 10:00:00', 'Профілактичний огляд.'),
(14, 3, '2024-12-18 12:00:00', 'Профілактичний огляд.'),
(14, 3, '2024-12-23 10:00:00', 'Проведення консультації.'),
(11, 3, '2024-12-23 17:00:00', 'Огляд пацієнта.'),
(5, 3, '2024-12-23 9:00:00', 'Проведення консультації.'),
(9, 3, '2024-12-23 17:00:00', 'Призначення лікування.'),
(17, 3, '2024-12-23 9:00:00', 'Проведення консультації.'),
(8, 10, '2024-12-28 13:00:00', 'Повторний прийом пацієнта.'),
(7, 7, '2024-12-20 13:00:00', 'Запланована зустріч з пацієнтом.'),
(5, 5, '2024-12-12 17:00:00', 'Результати обстеження.'),
(3, 7, '2024-12-31 17:00:00', 'Проведення аналізів.'),
(2, 1, '2024-12-18 11:00:00', 'Рекомендація щодо лікування.'),
(12, 5, '2024-12-16 16:00:00', 'Запланована зустріч з пацієнтом.'),
(13, 10, '2024-12-27 16:00:00', 'Рекомендація щодо лікування.'),
(10, 5, '2024-12-24 17:00:00', 'Результати обстеження.'),
(11, 9, '2024-12-12 10:00:00', 'Запланована зустріч з пацієнтом.'),
(14, 1, '2024-12-11 10:00:00', 'Проведення аналізів.'),
(7, 1, '2024-12-08 17:00:00', 'Повторний прийом пацієнта.'),
(4, 4, '2024-12-10 11:00:00', 'Проведення аналізів.'),
(5, 6, '2024-12-12 16:00:00', 'Повторний прийом пацієнта.'),
(10, 3, '2024-12-18 10:00:00', 'Рекомендація щодо лікування.'),
(3, 8, '2024-12-07 11:00:00', 'Повторний прийом пацієнта.'),
(6, 10, '2024-12-06 10:00:00', 'Повторний прийом пацієнта.'),
(15, 7, '2024-12-15 10:00:00', 'Рекомендація щодо лікування.'),
(13, 4, '2024-12-20 11:00:00', 'Рекомендація щодо лікування.'),
(14, 4, '2024-12-04 9:00:00', 'Проведення аналізів.'),
(17, 2, '2024-12-07 9:00:00', 'Проведення аналізів.'),
(8, 10, '2024-12-30 13:00:00', 'Рекомендація щодо лікування.'),
(6, 4, '2024-12-20 17:00:00', 'Рекомендація щодо лікування.'),
(2, 8, '2024-12-22 10:00:00', 'Рекомендація щодо лікування.'),
(5, 9, '2024-12-01 9:00:00', 'Рекомендація щодо лікування.'),
(4, 9, '2024-12-07 15:00:00', 'Повторний прийом пацієнта.'),
(13, 6, '2024-12-07 15:00:00', 'Результати обстеження.'),
(10, 4, '2024-12-15 11:00:00', 'Проведення аналізів.'),
(19, 3, '2024-12-30 17:00:00', 'Проведення аналізів.'),
(19, 3, '2024-12-21 15:00:00', 'Повторний прийом пацієнта.'),
(9, 4, '2024-12-31 15:00:00', 'Повторний прийом пацієнта.'),
(3, 7, '2024-12-27 12:00:00', 'Запланована зустріч з пацієнтом.'),
(9, 2, '2024-12-30 10:00:00', 'Рекомендація щодо лікування.'),
(4, 2, '2024-12-03 16:00:00', 'Повторний прийом пацієнта.'),
(5, 6, '2024-12-02 9:00:00', 'Запланована зустріч з пацієнтом.'),
(14, 3, '2024-12-05 10:00:00', 'Рекомендація щодо лікування.'),
(4, 5, '2024-12-06 13:00:00', 'Запланована зустріч з пацієнтом.'),
(11, 2, '2024-12-12 17:00:00', 'Проведення аналізів.'),
(18, 3, '2024-12-08 10:00:00', 'Повторний прийом пацієнта.'),
(2, 1, '2024-12-17 13:00:00', 'Проведення аналізів.'),
(13, 1, '2024-12-06 16:00:00', 'Запланована зустріч з пацієнтом.');






-- Додавання даних у таблицю MedicalRecords
INSERT INTO MedicalRecords (AmbulatoryCardID, HealthStatus, Notes)
VALUES
(1, 'Гострий фарингіт', 'Призначено курс антибіотиків'),
(2, 'Загальний стан добрий', 'Рекомендовано вітаміни'),
(3, 'Післяопераційний період', 'Рекомендована реабілітація'),
(4, 'Закладеність носа', 'Лікування спреями та інгаляції'),
(5, 'Поріз руки', 'Оброблено, накладено пов\'язку'),
(6, 'Хронічний синусит', 'Рекомендовано лікування антигістамінними'),
(7, 'Задовільний стан', 'Плановий огляд, без скарг'),
(8, 'Післяопераційний стан', 'Призначено додаткове обстеження'),
(9, 'Хронічний риніт', 'Призначено фізіотерапію'),
(10, 'Невеликі болі у спині', 'Рекомендовано консультацію невролога');


-- Додавання даних у таблицю AmbulatoryCards
INSERT INTO AmbulatoryCards (PatientID, EntryDate)
VALUES
(1, '2024-12-01'),
(2, '2024-12-02'),
(3, '2024-12-03'),
(4, '2024-12-04'),
(5, '2024-12-05'),
(6, '2024-12-06'),
(7, '2024-12-07'),
(8, '2024-12-08'),
(9, '2024-12-09'),
(10, '2024-12-10');





